Catalogs/Стелажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Стелажи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Полки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбщегоНазначенияСервер/Ext/Module.bsl
// Функция - Получает список полок из
//  выбранного Стелажа
//
// Параметры:
//  Стелаж - 	 -Справочник Стелажи 
// 
// Возвращаемое значение:
//  Результат -  список значений
Функция ПолучитьСписокПолок(Стелаж) Экспорт  
	Результат = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтелажиПолки.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Стелажи.Полки КАК СтелажиПолки
		|ГДЕ
		|	СтелажиПолки.Ссылка = &Стелаж";
	
	Запрос.УстановитьПараметр("Стелаж", Стелаж);
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Наименование");
	
  Возврат Результат;
КонецФункции
